[{"apply_url":"https://remoteOK.io/remote-jobs/105932-remote-senior-full-stack-engineer-rosemary-health","company":"Rosemary Health","company_logo":"","date":"2021-09-10T01:25:16+00:00","description":"At Rosemary, we’re rethinking the primary healthcare experience to deliver better care at scale. We are an online doctors practice with pharmacy delivery. We make it easy and convenient for patients to take control of their healthcare.\n \nSince launching 12 months ago we’ve experienced double digit month-on-month growth and helped thousands of Australians with their health needs.\n \nWe’re building a world class team as we scale for our next phase of growth. We’re looking for talented and driven individuals who thrive on ownership, influence and innovation to join us on this ride. This is a unique opportunity to join an early stage startup and play a key role in shaping the business. We pay well, offer generous equity, and provide the best tools money can buy.\n \nOur stack:\n- React + Typescript\n- Node + Typescript, Python\n- AWS: Serverless, Event-Driven\n \nThe role:\nWe're looking for a Senior Full-Stack Software Engineer to join our small but growing engineering team. You'll own features from conception to deployment, working across our full codebase to deliver an exceptional user experience. You'll drive cultural and technological change as we scale our teams and platforms.\n \nRequirements:\n- A pragmatic approach to software development\n- Years of seasoned experience across the front and back ends\n- Deep knowledge of React and Node\n- SQL chops\n- Empathy, respect, and excellent communication\n- Ability to thrive in a low process, high autonomy startup environment\n \nIf your experience looks a little different from what we’ve identified but you think you'd be great in this role, we’d love to learn more about you. Don't be shy!\n \nNice-to-have-experience:\n- Python\n- AWS\n- Mobile\n- OAuth2\n- Chat\n- Stripe integration\n- Datadog\n- Remote working\n \n\nCome join a rocket ship:\n\n🚀Backed by heavyweight Venture Capital - AUS, US and Singapore\n\n🏆 Experienced founding team - Our founders have scaled startups before, have deep health-tech experience and a strong clinical background\n\n📈 Equity (ESOP) in the business - Everyone benefits from the momentum they help create\n\n 💪🏼Flexible work - Work when and where you are most comfortable. If you want to come into the office, we are in the city, right next to Wynyard station\n\n⭐ A-class team - We know great businesses are built by great people\n\n 🙌 Fast-paced but supportive environment - You’ll be challenged to grow to your full potential\n\n💥 Impact - Your work will impact our members' lives all across the country\n \n","epoch":"1631237116","id":"105932","location":"Worldwide","original":true,"position":"Senior Full Stack Engineer","slug":"105932-remote-senior-full-stack-engineer-rosemary-health","tags":["react","node","front end","health tech","startup","series a","javascript","medical","full stack","senior","engineer"],"url":"https://remoteOK.io/remote-jobs/105932-remote-senior-full-stack-engineer-rosemary-health"},{"apply_url":"https://remoteOK.io/remote-jobs/105930-remote-node-js-developer-toptal","company":"Toptal","company_logo":"https://remoteOK.io/assets/jobs/7f4e98b8c8a6be9f89b7a7f5a6e796af1631210372.png","date":"2021-09-09T17:59:32+00:00","description":"***Design your full-time freelance career as a top freelance developer with Toptal.*** \n\nFreelance work is defining developer careers in exciting new ways. If you’re passionate about finding rapid career growth potential working with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift. \n\nToptal is an elite talent network made up of the world’s top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you’ll choose your own schedule and work from anywhere. **Jobs come to you, so you won’t bid for projects against other developers in a race to the bottom.** Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time. Our sophisticated screening process makes sure you are provided with top clients without additional overhead, as well as assistance in maximizing the potential of your full-time freelance career. Joining the Toptal network also gives you access to technical training programs, mentors, and coaching programs, so you can connect with a global community of experts like you to share peer-to-peer knowledge and expand your network globally. \n\nAs a freelance developer, you can become a part of an ever-expanding community of experts in over 120 countries, working remotely on projects that meet your career ambitions. \n\nThat’s why the world’s top 3% of developers choose Toptal. Developers in our elite network share:\n* English language proficiency\n* 3+ years of professional experience  \n* Knowledge of Node.js and frameworks available for it\n* Project management skills\n* A keen attention to detail\n* Experience with system architecture or leading a software team is a strong advantage\n* Full-time availability is a strong advantage\n\nCurious to know how much you could make? Check out our developer rate calculator: [https://topt.al/gxc5B5](https://topt.al/gxc5B5)\n\nIf you’re interested in pursuing an engaging career working on full-time freelance jobs for exclusive clients, take the next step by clicking apply and filling out the short form: [https://topt.al/4VcAxV](https://topt.al/4VcAxV)","epoch":"1631210372","id":"105930","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/7f4e98b8c8a6be9f89b7a7f5a6e796af1631210372.png","original":true,"position":"Node.js Developer","slug":"105930-remote-node-js-developer-toptal","tags":["backend","node js","node developer","js","javascript","node","dev","digital nomad"],"url":"https://remoteOK.io/remote-jobs/105930-remote-node-js-developer-toptal"},{"apply_url":"https://remoteOK.io/remote-jobs/105929-remote-shopify-developer-toptal","company":"Toptal","company_logo":"https://remoteOK.io/assets/jobs/a8da7b62670e0e642b5909de184d80cf1631210085.png","date":"2021-09-09T17:54:45+00:00","description":"***Design your full-time freelance career as a top freelance developer with Toptal.***\n\nFreelance work is defining developer careers in exciting new ways. If you’re passionate about finding rapid career growth potential working with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift. \n\nToptal is an elite talent network made up of the world’s top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you’ll choose your own schedule and work from anywhere. **Jobs come to you, so you won’t bid for projects against other developers in a race to the bottom.** Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time. Our sophisticated screening process makes sure you are provided with top clients without additional overhead, as well as assistance in maximizing the potential of your full-time freelance career. Joining the Toptal network also gives you access to technical training programs, mentors, and coaching programs, so you can connect with a global community of experts like you to share peer-to-peer knowledge and expand your network globally. \n\nAs a freelance developer, you can become a part of an ever-expanding community of experts in over 120 countries, working remotely on projects that meet your career ambitions. \n\nThat’s why the world’s top 3% of developers choose Toptal. Developers in our elite network share:\n* English language proficiency\n* 3+ years of professional experience  \n* Project management skills\n* A keen attention to detail\n* Experience with system architecture or leading a software team is a strong advantage\n* Full-time availability is a strong advantage\n\nCurious to know how much you could make? Check out our developer rate calculator: [https://topt.al/GqcM2n](https://topt.al/GqcM2n)\n\nIf you’re interested in pursuing an engaging career working on full-time freelance jobs for exclusive clients, take the next step by clicking apply and filling out the short form: [https://topt.al/a2cmAv](https://topt.al/a2cmAv)","epoch":"1631210085","id":"105929","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/a8da7b62670e0e642b5909de184d80cf1631210085.png","original":true,"position":"Shopify Developer","slug":"105929-remote-shopify-developer-toptal","tags":["front end","shopify","ecommerce","dev","digital nomad"],"url":"https://remoteOK.io/remote-jobs/105929-remote-shopify-developer-toptal"},{"apply_url":"https://remoteOK.io/remote-jobs/105928-remote-devops-engineer-tucows","company":"Tucows","company_logo":"https://remoteOK.io/assets/jobs/d15f808969087e61cb795baa45b935851631205239.png","date":"2021-09-09T16:33:59+00:00","description":"We are seeking to hire a keen and self-motivated individual who loves the Internet, and loves learning, sharing their knowledge and applying new technologies to complex problems.\n\nYou have notable experience developing software and are good at using frameworks like Ruby on Rails to implement features and ship code regularly. You are also capable of navigating large codebases and uncovering the complexity in existing systems. You are open to giving and receiving feedback, participating in code reviews and design discussions. In addition to the above, you are nimble and able to remain effective when priorities shift.\n\n# What you’ll be doing:\nIn the first 30 days:\n* Gain deep understanding of our existing platforms\n* Implement small stories and ensure quality through writing automated tests\n\nIn the first 3 months:\n* Contribute to technical design and architecture discussions\n* Participate in code reviews and ensure that development standards are adhered to\n* Design and implement features of increasing complexity\n\nIn the first year:\n* Share knowledge and act as a trusted mentor to junior team members.\n* Own projects or features from conception to release\n* Balance the need to ship code quickly with the need to make sound technical decisions.\n\n# Who you are:\n* Bachelor degree in Computer Science, Software Engineering or equivalent work experience\n* 5+ years professional experience in a software engineering environment\n* Experience building application in Ruby on Rails\n* Experience with Continuous Integration concepts and tools\n* Experience delivering highly available and reliable systems\n* Experience mentoring other developers\n* Good communication skills, both verbal and written\n* Familiarity with Docker and Kubernetes\n* Experience working in an agile environment\n* Exposure to multiple programming languages\n\n# About Tucows:\nTucows (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.\n\nWe embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!\n\nToday, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!\n______________\n\nWant to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality.\n\nWe also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation.\n\nLearn more about Tucows, our culture and employee benefits on our site [here](https://tucows.com/careers/).","epoch":"1631205239","id":"105928","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/d15f808969087e61cb795baa45b935851631205239.png","original":true,"position":"DevOps Engineer","slug":"105928-remote-devops-engineer-tucows","tags":["dev","ruby","python","kubernetes","docker","devops","engineer","digital nomad","devops","ruby"],"url":"https://remoteOK.io/remote-jobs/105928-remote-devops-engineer-tucows"},{"apply_url":"https://remoteOK.io/remote-jobs/105927-remote-customer-support-manager-commsor","company":"Commsor","company_logo":"https://remoteOK.io/assets/jobs/72cce72844de745746c5694235d0c27c1631198970.png","date":"2021-09-09T14:49:30+00:00","description":"The next 10 years will be dominated by community-led companies. But, creating a successful community is often difficult and time consuming. Commsor helps companies and teams build better and stronger communities. Our business encompasses our community operating system software (Commsor), our beloved community program (The Community Club), and now C School, our growing umbrella of educational offerings for community managers.\n\nWe're a small and fully distributed team, currently spanning California to Poland, and we take pride in our ability to function as an effective remote-first organization.\n\nWe offer market-rate salaries, a home office stipend, unlimited vacation (mandatory 3 weeks per year), health insurance, as many books as you could ever hope to read, and a tight-knit group of people passionate about creating for the future of community.\n\n##The Role\n\n**Whereabouts**: Fully-remote\n\n**Salary**: $60-70k/annually\n\n**Reporting to**: [Katelyn Gillum, Community Success Manager](https://www.linkedin.com/in/katelynrgillum/)\n\nAs the first Customer Support Manager at Commsor, you'll be one of the founding members of the Support team and will help Commsor build the framework, systems, and processes for how we provide high quality support to our customers.\n\nAs our customer community grows, we're looking for someone with a passion for both community and customer support to join our team. As a founding member of the Support team, you'll get the chance to build the structure and processes for how we support our customers from the ground up. Because you will be building this function from scratch, this role will have elements of operations, project management, and relationship building.\n\n##What you'll do at Commsor\n\n- Understand and resolve customer support issues while identifying root cause to improve the overall customer experience (and eventually lead a team of internal employees who will do the same)\n- Enhance customer satisfaction by working with teams across the company to continuously improve processes for case management, escalations, and communication\n- Monitor ticket flows and support quality across channels to improve efficiency and member interactions\n- Work closely with the engineering team and other business partners to ensure that we are helping to troubleshoot customer issues and work with teams to resolve them\n- Work with our support tech stack - including HelpDocs and our automated chat bot - to better manage support requests and understand trends behind the requests\n- Create a ‘customer experience feedback loop’, leveraging customer feedback and other data points to better understand key customer journeys and the customer experience along those journeys\n- Create support articles and video walkthroughs of the product to enable customers to learn about product capabilities\n- Continuously advocate for the customer and help to co-create an insights driven customer-centric culture at Commsor\n\n##Here's what we're looking for\n\n📈 Data-augmented\n\nThe ideal candidate for this role will use data to help inform their decisions and escalate customer feedback, while also understanding ways to uncover customer behavior and action drivers to other teams within Commsor.\n\n✨ Highly organized with an attention to detail\n\nBecause this is a role that blends operational and people-facing tasks, the most successful candidates need to have an above-average ability to shift between workflows seamlessly. They'll be strategic about what to prioritize and what to ignore. The best candidate is highly organized and proactive with a strong attention to detail and ability to lead projects in a fast paced environment.\n\n💬 Clear communicator with experience in cross-collaboration\n\nThe ideal candidate for this role will have the ability to distill complex issues into digestible summaries with clear direction on actions to be taken. In addition, being able to understand the role of customer support in gathering feedback on the customer experience and retaining users will be critical to this person's success in the role.\n\n✏️Technical writing\n\nWhile the ideal candidate isn't expected to be a technical content expert, they should have some experience in writing or maintaining a Knowledge Base.\n\n🖼️ Big picture, growth-oriented\n\nAs an early hire in a growing company, the best-fit candidates will have an interest in taking a holistic view of the Community Success team to help our customers grow and aren't afraid to take on tasks outside of the scope of the role.\n\n###What's required\n\nThis is a unique role that's all about supporting a critical function at Commsor—we're more interested in hiring candidates who can express how the skills they've learned transfer to this role than hiring for any particular job title in your history. We are open to various levels of experience and are willing to train the right person. That said, you'll stand out if you have background in:\n\n- 3+ years experience in a customer facing support function\n- An understanding of the concepts of user segmentation, personas, customer journeys, and lifetime value\n- Strong knowledge and experience with voice-of-the-customer tools\n- Prior experience managing direct reports and support teams\n\n###Bonus points\n\n- Prior experience in community (as a community manager or an active participant)\n- Prior experience in building peer-to-peer support programs\n- Comfortable working remotely\n\n\n*We’re committed to building a culturally diverse team and strongly encourage you to apply regardless of your location, background, race, gender, sexual orientation or any other personally defining attribute. We encourage every person who is interested to apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply. Take the leap - you never know, you might just be the perfect person for one of our open roles, even if you don’t match 100% of the job description.*","epoch":"1631198970","id":"105927","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/72cce72844de745746c5694235d0c27c1631198970.png","original":true,"position":"Customer Support Manager","slug":"105927-remote-customer-support-manager-commsor","tags":["community","saas","customer support","exec"],"url":"https://remoteOK.io/remote-jobs/105927-remote-customer-support-manager-commsor"},{"apply_url":"https://remoteOK.io/remote-jobs/105913-remote-senior-software-engineer-tucows","company":"Tucows","company_logo":"https://remoteOK.io/assets/jobs/eceb483ac47973ba5792ee0a05c9f0821631105600.png","date":"2021-09-08T12:53:20+00:00","description":"Tucows Wireless Services is building a new modern SaaS platform to help wireless companies operate around the world. The rollout of 5G networks in the US and elsewhere provides opportunities for innovation in the telecom space. And as an Internet company, our culture, experience and approach position us well to take advantage of these.\n\nIf you are a seasoned software engineer and this sounds like something you might like to be a part of, we may have a job for you!\n\n# Who You Are:\n* You enjoy greenfield software development\n* You excel at solving problems at scale for millions of people\n* You want to work with cutting edge technologies\n* You want to work with and learn from some of the smartest minds in the industry 3+ years of professional experience in software development\n* In depth knowledge of at least one of Ruby, Python, Go, or Scala\n* Solid understanding of Event Driven Architecture\n* Experience with Kafka\n* Experience with writing distributed applications\n* Experience with API application development\n* Experience with Data Persistence at scale using Postgres, Redis\n* Experience with writing highly testable code\n* Experience with writing highly observable systems using any of Prometheus, Grafana, Datadog, New Relic, etc\n* Experience with Infrastructure as Code using technologies such as Terraform, Nomad, Kubernetes, Docker, etc\n\n# Who You Might Be: \n* Demonstrated performance tuning skills\n* Strong troubleshooting skills\n* Advocates for automated testing and observability\n* Experience working in an agile environment\n* Contributions to an open-source project (of any kind)\n* An account on Github.com with samples of your code\n* Experience in the telecoms space\n\n# About Tucows\nTucows (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.\n\nWe embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!\n\nToday, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!\n_______________________\n\nWe offer a competitive compensation and benefits package with invested growth opportunities. If you are ready to be part of a fast-growing technology company where you determine your future, we want to hear from you.\n\nWant to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality.\n\nWe also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation.\n\nLearn more about Tucows, our culture and employee benefits on our site [here](https://tucows.com/careers/).\n","epoch":"1631105600","id":"105913","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/eceb483ac47973ba5792ee0a05c9f0821631105600.png","original":true,"position":"Senior Software Engineer","slug":"105913-remote-senior-software-engineer-tucows","tags":["dev","ruby","eda","python","go","scala","kafka","terraform","datadog","docker","golang","senior","engineer","digital nomad","ruby"],"url":"https://remoteOK.io/remote-jobs/105913-remote-senior-software-engineer-tucows"},{"apply_url":"https://remoteOK.io/remote-jobs/105912-remote-tech-lead-cto-saga-ventures","company":"Saga Ventures","company_logo":"https://remoteOK.io/assets/jobs/57a72e9ad817c83cefaff7a3f87dfc221631105493.png","date":"2021-09-08T12:51:33+00:00","description":"**The salary range is so wide because** I would like some of the compensation to be variable or performance based (such as bonuses when new apps and or meaningful features are launched). I know money is the most important thing to you. It is for me too. I am prepared to pay the right person a lot of money, especially for a remote job. This is up to you and I to discuss. If you want equity I am willing to do that after a standard vesting cliff period. In fact I would love if you really wanted equity and were that type of person -- one that cared about the long-term.\n\nSaga Ventures is hiring for the role of CTO/Tech Lead. We’ll give you any title you want if you get things done. \n\nAs CTO/Tech Lead you will be responsible for the oversight of, the hiring process of and the development of multiple web and mobile applications. \n\nSaga Ventures is a startup based in Switzerland that builds products that solve its founder’s problems. Basically the founder is solving his own problems with software. The founder is technical but has too many ideas and wants to implement more than one idea at a time. Your job is to lead the development of these software projects. Whether that is outsourcing hiring on freelance websites or hiring full time employees, that’s your choice (almost entirely; I may push back on a decision to see how well you’ve thought it out or something like that).\n\nTop 5 reasons to work with Saga Ventures.\n\nThe person you report to (me, the guy writing this) wants as minimal contact as possible. This means you will be working autonomously almost the entire time. You will be asked to give a weekly report of the progress made each week on each application. This is how I will judge your performance. I will track budgeting with you. We may need to have calls, especially at the beginning of the job, but I generally do not like having calls. I am not one of those bosses who insists on doing things for the sake of doing them.\n\nThis is not a role where you will learn from others, technically speaking. You should be confident and familiar with all aspects of web and mobile application development (React Native specific). You should be comfortable with and desire to work independently.\n\nThe ideas and applications we are working on are not pie in the sky ideas. They are all intended to solve current problems of the founder. For some of the ideas, competing applications exist. For others, the problems we will be working on are not currently realized by the public. They are new. One example problem is how to easily share only the code that a remote developer needs to work on a repository of code.\n\nTwo of the five ideas have partially developed apps. They need love and attention from someone focused.\n\nThe themes of the products are:\n\nRemote Work\nInvesting and Finance\nLanguage Learning\nLongevity/Anti-aging\n\nAll of the above themes are passions of his and industries he is highly experienced in (except longevity, that is a mere passion with a missing website ;).\n\nThings I Care About\n\nYour ability to work independently on full feature sets bringing product specifications to life.\nYou should basically never ask me a technical question. I am trying to not code at all here. I do product, design, strategy, finance, business stuff. You do and lead everything else.\nBe able to take ownership of problems with a determination to solve them (this sentence was from a boilerplate job description from another one that I copied but it sounded good.\n\nThings I don’t care about:\n\nAgile development or any other development styles and how you get things built. [I may steer you towards certain development approaches though (such as using the same tech stack and directory structure across apps to maximize development efficiency)].\nWhere you live\nWhen you work on a daily basis. If we don’t have to speak with one another, we don’t. It would be great if we could be a text-only company. Automattic is. Why can’t Saga Ventures be?\n\n\nSkills required:\n\nReact/React-Native/React-Native-Web for frontend\nExperience leading development projects or the confidence and ability to do so\nWould be nice if you had a good understanding of AWS with some devops experience\n\nAs CTO/Tech Lead you must be highly proficient in React Native. We share as much code as possible between mobile and web applications by using the React Native Web package.\n\nOur backend is the classic Express, MongoDB/Mongoose.","epoch":"1631105493","id":"105912","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/57a72e9ad817c83cefaff7a3f87dfc221631105493.png","original":true,"position":"Tech Lead CTO","slug":"105912-remote-tech-lead-cto-saga-ventures","tags":["react native","react","react native web","finance","longevity","remote work","language learning","javascript","web dev","tech lead","exec"],"url":"https://remoteOK.io/remote-jobs/105912-remote-tech-lead-cto-saga-ventures"},{"apply_url":"https://remoteOK.io/remote-jobs/105911-remote-systems-engineer-tucows","company":"Tucows","company_logo":"https://remoteOK.io/assets/jobs/c145c80262b496e798ed25300554d15c1631104227.png","date":"2021-09-08T12:30:27+00:00","description":"The Mobile Engineering Team is looking for the right engineer with a strong Devops and automation background to join our team. A successful candidate will be creating and building internal tools and APIs to enable our Continuous Integration / Continuous Deployment systems to efficiently manage our compute, network, and storage platforms.\n\nYou will have the opportunity to participate and be part of our highly skilled team and will contribute to the design, development, and engineering of the technology infrastructure supporting Ting Mobile services.\n\n# What You'll Do:\n* Collaborate with members of internal Engineering and DevOps Tools and Automation team to build and create internal tools and APIs for managing our network and cloud infrastructure.\n* Research, innovate and implement new technologies that improve our velocity.\n* Maintain and improve existing deployment tools.\n* Convert existing legacy applications to run on new technologies such as docker.\n* Provide domain expertise for solutions and applications for tooling\n\n# Who You Are:\n* Strong Python coding skills, 3+ years experience.\n* Shell scripting (Bash).\n* Extensive experience with Linux. We use Debian but we expect that you can easily pick up other distributions.\n* Experience with Saltstack or Ansible python based automation frameworks. Able to extend these frameworks with new modules.\n* Automating builds with Jenkins.\n* Experience with Docker.\n* Experience with Infrastructure as Code principles and best practices.\n* Experience with metric monitoring tools such as prometheus, alert manager, graylog, elastic search.\n* Excellent verbal and written communication skills.\n* Ability to learn quickly and comprehend new technologies.\n* Strong organizational and interpersonal skills, with an ability to build relationships.\n* Work effectively within a team environment.\n\n# Who You Might Be: \n* Familiarity with Kafka, Cassandra, Elastic stack, graylog.\n* Familiarity with Perl, Groovy and frameworks such as Django, Flask, Ruby On Rails.\n* Experience with Hashicorp tools such as Terraform, Nomad, Vault, Consul, Vagrant.\n* Familiarity with concepts of GitFlow and automation tools like github actions.\n\n\n# About Tucows\nTucows (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.\n\nWe embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!\n\nToday, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!\n_____________\n\nWe offer a competitive compensation and benefits package with invested growth opportunities. If you are ready to be part of a fast-growing technology company where you determine your future, we want to hear from you.\n\nWant to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality.\n\nWe also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation.\n\nLearn more about Tucows, our culture and employee benefits on our site [here](https://tucows.com/careers/).\n","epoch":"1631104227","id":"105911","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/c145c80262b496e798ed25300554d15c1631104227.png","original":true,"position":"Systems Engineer","slug":"105911-remote-systems-engineer-tucows","tags":["dev","python","bash","docker","linux","jenkins","kafka","systems engineer","engineer","digital nomad"],"url":"https://remoteOK.io/remote-jobs/105911-remote-systems-engineer-tucows"},{"apply_url":"https://remoteOK.io/remote-jobs/105910-remote-intermediate-devops-engineer-tucows","company":"Tucows","company_logo":"https://remoteOK.io/assets/jobs/59664e2586362465fac2320f5a9b26bf1631103790.png","date":"2021-09-08T12:23:10+00:00","description":"We are seeking to hire a keen and self-motivated individual who loves the Internet, and loves learning and applying new technologies to exciting problems.\n\nYou have notable experience developing software and are good at using languages like Perl to implement features in distributed systems. You are comfortable working at scale on dozens of interdependent components across multiple environments. You are also capable of navigating large codebases and uncovering the complexity in existing systems. You are open to giving and receiving feedback, participating in collaborative design discussions. In addition to the above, you are flexible and able to remain effective when priorities shift.\n\n# What you'll be doing:\n\n# First 30 days:\n* Join a team that is working on our core domain name registration system\n* Gain deep understanding of our existing platforms\n* Implement small stories and ensure quality through writing automated tests\n\n# First 3 months:\n* Contribute to technical design and architecture discussions\n* Participate in code reviews and ensure that development standards are adhered to\n* Design and implement features of increasing complexity\n\n# First year:\n* Share knowledge and act as a trusted mentor to junior team members and coops.\n* Implement projects and features from conception to release\n* Balance the need to ship code quickly with the need to make sound technical decisions.\n\n# Who You Are: \n* Bachelor degree in Computer Science, Software Engineering or equivalent work experience\n* 3+ years professional experience in software development\n* Experience building software in Object Oriented Perl \n* Experience working with development best practices (version control, unit testing)\n* Experience with Continuous Integration concepts and tools\n* Experience delivering highly available and reliable systems\n* Good communication skills, both verbal and written\n\n# Who You Might Be:\n* Understanding of Python is a huge plus\n* Experience building integrations with 3rd party systems\n* Experience building software iteratively using feature flags\n* Experience working in an agile environment\n* Exposure to multiple programming languages\n\n# About Tucows\nTucows (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.\n\nWe embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!\n\nToday, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!\n___________________\n\nWe offer a competitive compensation and benefits package with invested growth opportunities. If you are ready to be part of a fast-growing technology company where you determine your future, we want to hear from you.\n\nWant to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality.\n\nWe also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation.\n\nLearn more about Tucows, our culture and employee benefits on our site [here](https://tucows.com/careers/).\n\n\n\n","epoch":"1631103790","id":"105910","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/59664e2586362465fac2320f5a9b26bf1631103790.png","original":true,"position":"Intermediate DevOps Engineer","slug":"105910-remote-intermediate-devops-engineer-tucows","tags":["dev","devops","python","perl","engineer","digital nomad","devops"],"url":"https://remoteOK.io/remote-jobs/105910-remote-intermediate-devops-engineer-tucows"},{"apply_url":"https://remoteOK.io/remote-jobs/105851-remote-senior-product-designer-citizenlab","company":"CitizenLab","company_logo":"https://remoteOK.io/assets/jobs/858f9c609422def965f3f676799f8d4d1630926683.png","date":"2021-09-06T11:11:23+00:00","description":"Do you want to join us on our mission to shape democracies for the digital age? Are you looking for an international and fast-paced, yet collaborative and inclusive environment to thrive in?\n\nYou have come to the right place.\n\nCitizenLab, a social impact scale-up with its HQ in Brussels, aims to make public decision-making more participatory, inclusive, and responsive. The SaaS platform is already being used by over 300 cities and municipalities in +18 different countries, facilitating two-way communication between governments and their citizens. Since it was founded in 2015, CitizenLab gave +750,000 citizens a direct voice in local politics and got recognized as 'Best Social Impact Startup in Europe'. CitizenLab is looking for purpose-driven talent to join us on our mission to have +2.5 million citizens actively participate via its e-democracy platforms in cities across the globe.\n\n## Senior Product Designer at CitizenLab\n\nAs Senior Product Designer, you play a key role in both shaping the future of our digital democracy platform through superbly researched and designed solutions, as well as bringing Design at CitizenLab to a whole new level overall by setting a design system in place to collaborate with other designers.\n\nYou are a member of the cross-functional Engagement squad, with a product manager and five engineers. The Engagement squad is working on our core participation platform, with the goal of getting more citizens involved in democracy and designing higher-impact participatory processes. You will report to the team lead of Product, and closely collaborate with the visual designer, product designer (Insights), and product managers. Initially, you will work with other designers in a working group structure, yet we expect a separate Design team to emerge in the near future as we continue to grow.\n\nYour responsibilities include:\n\n*   Drive the evolution of our **design system**, working with the product teams to build Figma libraries and documentation within clear frameworks and guidelines.\n\n*   Work closely with engineering peers to implement **high-quality solutions.**\n\n*   Leverage **research techniques** and tools such as wireframes, sketches, and live-data prototypes to test and improve **product experiences.**\n\n*   **Design components, interactions, and transitions** in Figma and thoroughly test the **usability** of the solution with real users and data.\n\n*   Ensure a consistent and evolving **visual identity** across all touchpoints, including all our products, in close collaboration with the visual designer.\n\n*   Act as a **coach and mentor other designers** on the team, and help them grow.\n\n## What do we expect from you?\n\n*   **+5 years of experience** in product design, ideally in a tech environment. You know what’s needed to scale design when growing from start-up to scale-up.\n\n*   Demonstrable experience building or contributing to a **design system**, including component design, documentation, and education.\n\n*   Outstanding ability to **deliver designs** **from concept to implementation**; from user flows to prototypes to world-class UI design.\n\n*   Strong appetite to help other designers grow through your **mentoring**. Ideally, previous experience **leading a design team**.\n\n*   Advanced knowledge of **Figma’s** design tool. Working knowledge of other contemporary design and prototyping tools, e.g. Framer or Principle.\n\n*   Good knowledge of **HTML and CSS**, as well as a basic familiarity with **ReactJS**, to be able to implement some of your own designs.\n\n*   Understanding of technical constraints when designing solutions. Familiarity with **inclusive design** principles and best practices.\n\n*   Strong communication, **collaboration** and creative problem-solving skills.\n\n*   Well-developed **UX research** competences and highly familiar with a wide range of techniques for product discovery, user behavior, and usability testing.\n\n*   Ideally, strong **UX writing** skills. You enjoy crafting delightful microcopy. And helping us write better job ads for future design hires.\n\n*   Very fluent in **English**. Proficiency in Dutch, French, or other European languages can be a plus for your research.\n\n*   Working in the **European timezone**. Possibility to relocate to Brussels is a bonus, not a must.\n\n## What can you expect from us?\n\n*   Unlock your full potential and have a social **impact at scale**. Day-to-day we work with local government leaders across the world to help them connect with their communities.\n\n*   Become a key factor in our rapid transition from a startup to a **scaleup** (50 employees), and our expansion from Europe to the United States.\n\n*   Work in a **fast-paced, collaborative, and supportive** environment. We share a participatory culture of autonomy and ownership by everyone, not only by leadership.\n\n*   Be part of our **dynamic, international team**. We organize many team activities and afterworks (when possible). We are as serious about our work in digital democracy as we are about having fun on our journey together.\n\n*   Enjoy an **informal work vibe** with open communication and full transparency on results.\n\n*   Participate in our **various team events**, inspiring team lunches, our company book club, bi-quarterly strategic town halls, and yearly off-site team retreats.\n\n*   Spend 10% of your time on **personal projects and self-development** for the long run. We’re committed to both collective and individual growth.\n\n*   Receive a **competitive salary package**, incl. perks such as 26 paid holidays, a professional development budget, well-being budget, collective bonus plan, your own laptop, full flexibility on working from home, and much more.\n\n_CitizenLab is committed to being a diverse and inclusive workplace. We encourage applicants of different backgrounds, genders, experiences, abilities, and perspectives to apply._","epoch":"1630926683","id":"105851","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/858f9c609422def965f3f676799f8d4d1630926683.png","original":true,"position":"Senior Product Designer","slug":"105851-remote-senior-product-designer-citizenlab","tags":["design","product design","ux ui","civic tech","design system","sys admin","senior","admin","digital nomad"],"url":"https://remoteOK.io/remote-jobs/105851-remote-senior-product-designer-citizenlab"},{"apply_url":"https://remoteOK.io/remote-jobs/105833-remote-qa-lead-engineer-the-giving-block","company":"The Giving Block","company_logo":"https://remoteOK.io/assets/jobs/67a6d452db296bddc540790901c8410f1630668448.png","date":"2021-09-03T11:27:28+00:00","description":"# About The Giving Block (TGB)\n\nTGB is a venture capital backed company that makes it easy for nonprofits to accept cryptocurrency donations like bitcoin while also offering donors a more tax efficient way to support their favorite causes. We are the marketing leading provider and work with 400 nonprofits, including some of the largest (like United Way Worldwide and American Cancer Society). We are raising millions of dollars worth of crypto per month and are growing quickly.\n\n  \n\nOur goal is to make accepting cryptocurrency donations just as easy as credit card donations. Join us in equipping millions of nonprofits around the world to accept cryptocurrency donations.\n\n# Role Description\n\nThe Giving Block is looking for someone (remote) to take the lead on all things in terms of quality assurance of our products. From our widget, donation platform, API and various dashboards, the QA will be responsible for ensuring that our products function as expected and eliminating any bugs.\n\n  \n  \n\n# Responsibilities:\n\n-   Building the testing process in a team and its constant improvement\n    \n-   Implementation of new testing tools\n    \n-   Quality assurance of team releases\n    \n-   Manual web application testing\n    \n-   Development, writing, execution and support of test cases, and preparation of checklists\n    \n-   Perform regression, functional, integration testing\n    \n-   Bug report collection, prioritization and control of corrections\n    \n-   REST API, SOAP testing\n    \n-   Analysis of system logs to identify web application crashes and other cases of anomalous system behavior (especially after releases)\n    \n-   Communication with stakeholders to understand business requirements\n    \n\n  \n\n# Requirements:\n\n-   At least 5 years of testing experience\n    \n-   Basic knowledge of SQL, writing queries\n    \n-   Good knowledge of DevTools\n    \n-   Good understanding of how to test REST API and SOAP\n    \n-   Ability to work with log systems (Bugsnag, Sentry, AWS)\n    \n-   Understanding HTTP (S), JSON, XML\n    \n-   Ability to clearly and competently express your thoughts in writing\n    \n-   Great level of soft-skills, ability to negotiate\n    \n-   Test automation experience\n    \n-   Basic knowledge of JS\n    \n-   Fluent English and experience working with an international team\n    \n-   Optional: Understanding agile principles\n    \n# Benefits / Perks:\n\n-   Competitive compensation packages (salary, benefits, stock options, etc.)\n    \n-   Remote First: Flexible work location and hours\n    \n-   Paid vacation days and company-wide holidays\n    \n-   Company issued laptop and equipment\n    \n-   Fast paced environment without bureaucracy\n    \n-   Annual team building meetup in Europe","epoch":"1630668448","id":"105833","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/67a6d452db296bddc540790901c8410f1630668448.png","original":true,"position":"QA Lead Engineer","slug":"105833-remote-qa-lead-engineer-the-giving-block","tags":["testing","qa","automation","quality assurance","exec","engineer"],"url":"https://remoteOK.io/remote-jobs/105833-remote-qa-lead-engineer-the-giving-block"},{"apply_url":"https://remoteOK.io/remote-jobs/105824-remote-perl-software-developer-tucows","company":"Tucows","company_logo":"https://remoteOK.io/assets/jobs/c61b972823bcb678703518068d011a381630596195.png","date":"2021-09-02T15:23:15+00:00","description":"We are seeking to hire a keen and self-motivated individual who loves the Internet, and loves learning and applying new technologies to exciting problems. \n\nYou have notable experience developing software and are good at using languages like Perl to implement features in distributed systems. You are comfortable working at scale on dozens of interdependent components across multiple environments. You are also capable of navigating large codebases and uncovering the complexity in existing systems. You are open to giving and receiving feedback, participating in collaborative design discussions. In addition to the above, you are flexible and able to remain effective when priorities shift. \n\n# What you’ll be doing:\n\n-----------\n# First 30 days:\n* Join a team that is working on our core domain name registration system\n* Gain deep understanding of our existing platforms\n* Implement small stories and ensure quality through writing automated tests\n\n# First 3 months:\n* Contribute to technical design and architecture discussions\n* Participate in code reviews and ensure that development standards are adhered to\n* Design and implement features of increasing complexity\n\n# First year:\n\n* Share knowledge and act as a trusted mentor to junior team members and coops.\n* Implement projects and features from conception to release\n* Balance the need to ship code quickly with the need to make sound technical decisions.\n\n# Key skills and experience:\n\n* Bachelor degree in Computer Science, Software Engineering or equivalent work experience\n* 3+ years professional experience in software development\n* Experience building software in Object Oriented Perl \n* Experience working with development best practices (version control, unit testing)\n* Experience with Continuous Integration concepts and tools\n* Experience delivering highly available and reliable systems\n* Good communication skills, both verbal and written\n\n# Nice to have skills and experience:\n\n* Understanding of Python is a huge plus\n* Experience building integrations with 3rd party systems\n* Experience building software iteratively using feature flags\n* Experience working in an agile environment\n* Exposure to multiple programming languages\n\n# About Tucows\nTucows (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.\n\nWe embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!\n\nToday, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!\n\n-----------\n\nWe offer a competitive compensation and benefits package with invested growth opportunities. If you are ready to be part of a fast-growing technology company where you determine your future, we want to hear from you. \n\nWant to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality. \n\nWe also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view. \n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation. \n\nLearn more about Tucows, our culture and employee benefits on our site [here](https://tucows.com/careers/).","epoch":"1630596195","id":"105824","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/c61b972823bcb678703518068d011a381630596195.png","original":true,"position":"Perl Software Developer","slug":"105824-remote-perl-software-developer-tucows","tags":["dev","perl","python","digital nomad"],"url":"https://remoteOK.io/remote-jobs/105824-remote-perl-software-developer-tucows"},{"apply_url":"https://remoteOK.io/remote-jobs/105823-remote-senior-software-engineer-tucows","company":"Tucows","company_logo":"https://remoteOK.io/assets/jobs/d00154315528a6cff259b4fc118698e61630595966.png","date":"2021-09-02T15:19:26+00:00","description":"We are inviting an experienced Senior Software engineer to join our team, which builds and maintains a host of services that are used across all of Tucows’ major business units. We are evolving our platforms to microservices to enable functions within Tucows across all of our platforms. \n\n# Who You Are\n* Have software engineering experience and a record of writing elegant, maintainable, self-documenting code in  Python.\n* You have 5+ years of software engineering experience.\n* You have experience with web frameworks such as Flask, Django, and FastAPI.\n* You have supported customer-facing, Enterprise level applications including on-call support\n* Have experience with open source databases such as Postgres and MariaDB.\n* You have demonstrated experience with docker based applications\n* You are familiar with microservice architecture frameworks and design patterns.\n* You know, and can demonstrate, the value of agile processes, continuous integration, and continuous delivery.\n* You enjoy sharing your knowledge with people you work with.\n* You have excellent written and verbal communication skills.\n\n# Who You Might Be:\n* Someone who has experience with authentication technologies and protocols such as OpenID\n* Someone who has worked with authentication-related security features such as MFA\n\n# About Tucows\nTucows (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.\n\nWe embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!\n\nToday, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!\n\n-----------\n\nWe offer a competitive compensation and benefits package with invested growth opportunities. If you are ready to be part of a fast-growing technology company where you determine your future, we want to hear from you. \n\nWant to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality. \n\nWe also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view. \n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation. \n\nLearn more about Tucows, our culture and employee benefits on our site [here](https://tucows.com/careers/). ","epoch":"1630595966","id":"105823","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/d00154315528a6cff259b4fc118698e61630595966.png","original":true,"position":"Senior Software Engineer","slug":"105823-remote-senior-software-engineer-tucows","tags":["dev","linux","python","postgres","mariadb","openid","senior","engineer","digital nomad"],"url":"https://remoteOK.io/remote-jobs/105823-remote-senior-software-engineer-tucows"},{"apply_url":"https://remoteOK.io/remote-jobs/105822-remote-software-engineer-tucows","company":"Tucows","company_logo":"https://remoteOK.io/assets/jobs/2715c4497af17080995750eca9caf5851630595762.png","date":"2021-09-02T15:16:02+00:00","description":"We are inviting experienced, Software engineers to join our team, which builds and maintains a host of services that are used across all of Tucows’ major business units. We are evolving our platforms into microservices to enable functions within Tucows across all of our platforms. \n\n# Who You Are\n\n* Have software engineering experience and a record of writing elegant, maintainable, self-documenting code in Python.\n* You have 3-5 years of software engineering experience.\n* You have experience with web frameworks such as Flask, Django, and FastAPI.\n* Have experience with open source databases such as Postgres and MariaDB.\n* You are familiar with microservice architecture frameworks and design patterns.\n* You know, and can demonstrate, the value of agile processes, continuous integration, and continuous delivery.\n* You enjoy sharing your knowledge with people you work with.\n* You have excellent written and verbal communication skills\n\n# About Tucows\nTucows (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.\n\nWe embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!\n\nToday, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!\n\n-----------\n\nWe offer a competitive compensation and benefits package with invested growth opportunities. If you are ready to be part of a fast-growing technology company where you determine your future, we want to hear from you. \n\nWant to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality. \n\nWe also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view. \n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation. \n\nLearn more about Tucows, our culture and employee benefits on our site [here](https://tucows.com/careers/). ","epoch":"1630595762","id":"105822","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/2715c4497af17080995750eca9caf5851630595762.png","original":true,"position":"Software Engineer","slug":"105822-remote-software-engineer-tucows","tags":["dev","linux","mariadb","postgres","python","engineer","digital nomad"],"url":"https://remoteOK.io/remote-jobs/105822-remote-software-engineer-tucows"},{"apply_url":"https://remoteOK.io/remote-jobs/105821-remote-infrastructure-automation-system-engineer-tucows","company":"Tucows","company_logo":"https://remoteOK.io/assets/jobs/058266544a638e1f0be04a1eea62a3ca1630595175.png","date":"2021-09-02T15:06:15+00:00","description":"# About The Role\n_____\n# What You’ll Do:\n* Work as an embedded member of an Agile team to provide end-to-end responsibility for applications and microservices.\n* Build automation to provision infrastructure as code to cloud platforms.\n* Enable secure application infrastructure with secure secret storage, dynamic secrets, and data encryption.\n* Enable developers to continuously build and deploy via cluster management and schedulers, and service discovery via a service mesh.\n* Mentor team members to modernize their DevOps skills and processes.\n* Build and launch scalable, reliable, and resilient microservices.\n* Employ Agile software development tools and standard methodologies.\n\n# Who You Are:\n* Have substantive DevOps experience and a consistent record of automating the provisioning of infrastructure as code.\n* You have experience with CI/CD automation, and in particular in a cloud engineering environment.\n* Have years of experience with Linux, server automation, and scripting.\n* You are familiar with microservice architecture frameworks and design patterns.\n* You know how the Internet works, understand massaging and async frameworks, and understand modern API frameworks.\n* You have experience managing load balancers, cloud native edge routers, and API gateways.\n* You know, and can demonstrate, the value of agile processes, continuous integration, and continuous delivery.\n* You enjoy sharing your knowledge and mentoring people you work with.\n* You have excellent written and verbal communication skills.\n* You love to collaborate, are a great teammate, an excellent listener, and are fun to work with.\n\n# Who You Might Be:\n* Someone with experience with the HashiCorp stack.\n* Someone with wholesale or retail domain names experience.\n* A person who’s worked for an ISP.\n* Someone that’s familiar with telcos, especially MVNOs.\n\n# About Tucows\nTucows (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.\n\nWe embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!\n\nToday, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!\n\n-----------\n\nWe offer a competitive compensation and benefits package with invested growth opportunities. If you are ready to be part of a fast-growing technology company where you determine your future, we want to hear from you. \n\nWant to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality. \n\nWe also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view. \n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation. \n\nLearn more about Tucows, our culture and employee benefits on our site [here](https://tucows.com/careers/). \n","epoch":"1630595175","id":"105821","location":"Worldwide","logo":"https://remoteOK.io/assets/jobs/058266544a638e1f0be04a1eea62a3ca1630595175.png","original":true,"position":"Infrastructure Automation System Engineer","slug":"105821-remote-infrastructure-automation-system-engineer-tucows","tags":["dev","linux","hashicorp","sys admin","engineer","digital nomad","admin"],"url":"https://remoteOK.io/remote-jobs/105821-remote-infrastructure-automation-system-engineer-tucows"}]